SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_СЕССИЯ"."ДАТА"
FROM "Н_ЛЮДИ"
LEFT JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Сергеевич'
AND "Н_СЕССИЯ"."ДАТА" < DATE '2002-01-04'
AND "Н_СЕССИЯ"."ДАТА" = DATE '2012-01-25';

SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ВЕДОМОСТИ"."ДАТА", "Н_СЕССИЯ"."ИД"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_СЕССИЯ"."СЭС_ИД" = "Н_ВЕДОМОСТИ"."ИД"
WHERE "Н_ЛЮДИ"."ИМЯ" > 'Ярослав'
AND "Н_ВЕДОМОСТИ"."ИД" < 1250972;

SELECT COUNT(*)
FROM "Н_УЧЕНИКИ"
JOIN "Н_ОБУЧЕНИЯ" ON "Н_УЧЕНИКИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
JOIN "Н_ЛЮДИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3102'
AND DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) < 20;

SELECT "ГРУППА"
FROM "Н_УЧЕНИКИ"
WHERE "ИД" IN (
    SELECT "ЧЛВК_ИД"
    FROM "Н_ОБУЧЕНИЯ"
    WHERE "ЧЛВК_ИД" IN (
        SELECT "ИД"
        FROM "Н_ПЛАНЫ"
        WHERE "УЧЕБНЫЙ_ГОД" = '2010/2011'
        AND "ИД" IN (
            SELECT "ИД"
            FROM "Н_ОТДЕЛЫ"
            WHERE "ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники'
        )
    )
)
GROUP BY "ГРУППА"
HAVING COUNT(*) = 10;

SELECT "Н_УЧЕНИКИ"."ГРУППА", avg(date_part('year', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
FROM "Н_ЛЮДИ"
JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING avg(date_part('year', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) = (
	SELECT avg(date_part('year', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
	FROM "Н_ЛЮДИ"
	JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
	WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100'
);

SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ"
JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "Н_УЧЕНИКИ"."КОНЕЦ" < '2012-09-01'
AND "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
AND ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная' 
	OR "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная');

SELECT DISTINCT "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ДАТА_РОЖДЕНИЯ"
FROM "Н_ЛЮДИ"
WHERE "ИМЯ" IN (
    SELECT "ИМЯ"
    FROM "Н_ЛЮДИ"
    GROUP BY "ИМЯ"
    HAVING COUNT(DISTINCT "ДАТА_РОЖДЕНИЯ") > 1
)
ORDER BY "ИМЯ", "ДАТА_РОЖДЕНИЯ";