-- Ñäåëàòü çàïðîñ äëÿ ïîëó÷åíèÿ àòðèáóòîâ èç óêàçàííûõ òàáëèö, ïðèìåíèâ ôèëüòðû ïî óêàçàííûì óñëîâèÿì:
-- Òàáëèöû: Í_ËÞÄÈ, Í_ÑÅÑÑÈß.
-- Âûâåñòè àòðèáóòû: Í_ËÞÄÈ.ÈÌß, Í_ÑÅÑÑÈß.Ó×ÃÎÄ.
-- Ôèëüòðû (AND):
-- a) Í_ËÞÄÈ.ÔÀÌÈËÈß = Èâàíîâ.
-- b) Í_ÑÅÑÑÈß.ÈÄ = 1975.
-- c) Í_ÑÅÑÑÈß.ÈÄ > 14369.
-- Âèä ñîåäèíåíèÿ: RIGHT JOIN.

SELECT
    Í_ËÞÄÈ.ÈÌß,
    Í_ÑÅÑÑÈß.Ó×ÃÎÄ
FROM
    Í_ËÞÄÈ
RIGHT JOIN
    Í_ÑÅÑÑÈß ON Í_ËÞÄÈ.ÈÄ = Í_ÑÅÑÑÈß.×ËÂÊ_ÈÄ
WHERE
    Í_ËÞÄÈ.ÔÀÌÈËÈß = 'Èâàíîâ'
    AND Í_ÑÅÑÑÈß.ÈÄ = 1975
    AND Í_ÑÅÑÑÈß.ÈÄ > 14369;